Tekla Open API Reference for Tekla Structures 2025
PropertyElement.PropertyElementType.DetailMarkPropertyElementTypes Class
 The DetailMarkPropertyElementTypes class represents the available property element types for detail marks.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PropertyElement.PropertyElementType.DetailMarkPropertyElementTypes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public static class DetailMarkPropertyElementTypes
<SerializableAttribute>
Public NotInheritable Class DetailMarkPropertyElementTypes
The PropertyElement.PropertyElementType.DetailMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
DetailName
Returns the detail name property element type.
SourceDrawingName
Returns the source drawing name property element type.
SourceDrawingNameWhenMoved
Returns the source drawing name when moved property element type.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace